Hi @janegilring! Thanks for that additional context.

Unfortunately I've not been able to reproduce this yet. Here is what I tried, using the beta2 build...

First, I copied the root module source code you shared into a file on my machine and run `terraform init`, and got the same module dependency problem you saw:

```
$ terraform init
Initializing modules...
Downloading Azure/compute/azurerm 1.2.1 for compute...
- compute in .terraform/modules/compute/Azure-terraform-azurerm-compute-dbe0daa
- compute.os in .terraform/modules/compute/Azure-terraform-azurerm-compute-dbe0daa/os
Downloading Azure/network/azurerm 2.0.0 for network...
- network in .terraform/modules/network/Azure-terraform-azurerm-network-564155f

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...

Provider "random" v1.3.1 is not compatible with Terraform 0.12.0-beta2.

Provider version 2.1.0 is the earliest compatible version. Select it with 
the following version constraint:

	version = "~> 2.1"

Terraform checked all of the plugin versions matching the given constraint:
    ~> 1.0

Consult the documentation for this provider for more information on
compatibility between provider and Terraform versions.

- Downloading plugin for provider "azurerm (terraform-providers/azurerm)" (1.27.1)...

Error: incompatible provider version
```

So I edited the module in place to change that dependency to `>= 1.0` instead and ran init again:

```
$ terraform init
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "random (terraform-providers/random)" (2.1.2)...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

So that left me with the following installed:

```
$ terraform version
Terraform v0.12.0-beta2
+ provider.azurerm v1.27.1
+ provider.random v2.1.2
```

But bext I tried `terraform plan`, and it succeeded for me:

```
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.azurerm_availability_set.vm will be created
  + resource "azurerm_availability_set" "vm" {
      + id                           = (known after apply)
      + location                     = "westeurope"
      + managed                      = true
      + name                         = "demowinvm-avset"
      + platform_fault_domain_count  = 2
      + platform_update_domain_count = 2
      + resource_group_name          = "terraform-demo-rg"
      + tags                         = {
          + "Source" = "terraform"
        }
    }

  # module.compute.azurerm_network_interface.vm[0] will be created
  + resource "azurerm_network_interface" "vm" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "nic-demowinvm-0"
      + network_security_group_id     = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "terraform-demo-rg"
      + tags                          = {
          + "Source" = "terraform"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "ipconfig0"
          + primary                                       = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.compute.azurerm_network_security_group.vm will be created
  + resource "azurerm_network_security_group" "vm" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "demowinvm-22-nsg"
      + resource_group_name = "terraform-demo-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow remote protocol in from all locations"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "allow_remote_22_in_all"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Source" = "terraform"
        }
    }

  # module.compute.azurerm_public_ip.vm[0] will be created
  + resource "azurerm_public_ip" "vm" {
      + allocation_method            = (known after apply)
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "westeurope"
      + name                         = "demowinvm-0-publicIP"
      + public_ip_address_allocation = "dynamic"
      + resource_group_name          = "terraform-demo-rg"
      + sku                          = "Basic"
      + tags                         = {
          + "Source" = "terraform"
        }
    }

  # module.compute.azurerm_resource_group.vm will be created
  + resource "azurerm_resource_group" "vm" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "terraform-demo-rg"
      + tags     = {
          + "Source" = "terraform"
        }
    }

  # module.compute.azurerm_virtual_machine.vm-linux[0] will be created
  + resource "azurerm_virtual_machine" "vm-linux" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "westeurope"
      + name                             = "demowinvm0"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "terraform-demo-rg"
      + tags                             = {
          + "Source" = "terraform"
        }
      + vm_size                          = "Standard_DS1_V2"

      + boot_diagnostics {
          + enabled = false
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "azureuser"
          + computer_name  = "demowinvm0"
          + custom_data    = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "..."
              + path     = "/home/azureuser/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "CentOS"
          + publisher = "OpenLogic"
          + sku       = "7.5"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "osdisk-demowinvm-0"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.compute.random_id.vm-sa will be created
  + resource "random_id" "vm-sa" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 6
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "vm_hostname" = "demowinvm"
        }
    }

  # module.network.azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "terraform-demo-rg"
      + tags     = (known after apply)
    }

  # module.network.azurerm_subnet.subnet[0] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix       = "10.0.1.0/24"
      + id                   = (known after apply)
      + ip_configurations    = (known after apply)
      + name                 = "subnet1"
      + resource_group_name  = "terraform-demo-rg"
      + virtual_network_name = "acctvnet"
    }

  # module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "acctvnet"
      + resource_group_name = "terraform-demo-rg"
      + tags                = {
          + "Source" = "terraform"
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

For the sake of completeness, I also ran `terraform apply`:

```
$ ~/apps/terraform-0.12.0-beta2/terraform apply

(same plan output as above elided)

Plan: 10 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.compute.random_id.vm-sa: Creating...
module.compute.random_id.vm-sa: Creation complete after 0s [id=rTqyOJBV]
module.network.azurerm_resource_group.network: Creating...
module.compute.azurerm_resource_group.vm: Creating...
module.network.azurerm_resource_group.network: Creation complete after 2s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg]
module.network.azurerm_virtual_network.vnet: Creating...
module.compute.azurerm_resource_group.vm: Creation complete after 4s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg]
module.compute.azurerm_public_ip.vm[0]: Creating...
module.compute.azurerm_availability_set.vm: Creating...
module.compute.azurerm_network_security_group.vm: Creating...
module.network.azurerm_virtual_network.vnet: Creation complete after 7s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Network/virtualNetworks/acctvnet]
module.compute.azurerm_availability_set.vm: Creation complete after 4s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Compute/availabilitySets/demowinvm-avset]
module.network.azurerm_subnet.subnet[0]: Creating...
module.network.azurerm_subnet.subnet[0]: Creation complete after 3s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1]
module.compute.azurerm_network_security_group.vm: Creation complete after 7s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Network/networkSecurityGroups/demowinvm-22-nsg]
module.compute.azurerm_public_ip.vm[0]: Creation complete after 7s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Network/publicIPAddresses/demowinvm-0-publicIP]
module.compute.azurerm_network_interface.vm[0]: Creating...
module.compute.azurerm_network_interface.vm[0]: Creation complete after 4s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Network/networkInterfaces/nic-demowinvm-0]
module.compute.azurerm_virtual_machine.vm-linux[0]: Creating...
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [10s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [20s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [30s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [40s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [50s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [1m0s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [1m10s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [1m20s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Still creating... [1m30s elapsed]
module.compute.azurerm_virtual_machine.vm-linux[0]: Creation complete after 1m38s [id=/subscriptions/8708baf2-0a54-4bb4-905b-78d21ac150da/resourceGroups/terraform-demo-rg/providers/Microsoft.Compute/virtualMachines/demowinvm0]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.
```

It seems like there must be some other interesting difference in your environment that is making this behave differently, @janegilring. From reviewing both of those modules though, I'm having trouble developing any theories about what _could_ be a significant difference here.

If you're able, I think it would be useful to see the result of running `terraform plan` with the `TF_LOG=trace` environment variable set. If you can, please share the result of that in a [gist](https://gist.github.com/) (the full log output is too verbose for a GitHub comment) and that will hopefully give enough context for us to understand what is different about your environment vs. mine.
